#Python教學 (初學者入門)
#影片(不是我的！)：https://www.youtube.com/watch?v=zdMUJJKFdsU
#如果要清除終端機的所有指令，用cls(Windows) / clear(Mac) 清除指令

#XIV. 二維列表 & 巢狀迴圈

#XIV-A. 二維列表

#回顧：列表

d = ["I","D","K"] #列表是可以存放很多個值的資料型態

#但是...這只是一個1D(一維)的列表，怎樣可以把列表變成2D(二維)呢？

#XIV-A1. 維度提升
xiv_a1 = [["A","B","C"],["D","E","F"],["G","H","I"]]
#為了讓二維列表更有感覺，可以寫成下面的形式：
xiv_a1plus = [
    ["A","B","C"], #第0行 (Row0)
    ["D","E","F"], #第1行 (Row1)
    ["G","H","I"]  #第2行 (Row2)
] #每行有3列 (3 Columns) (也是從0算起！)

#XIV-A2. 取值
#XIV-A201. 第0行，第0列
print(xiv_a1plus[0][0])
#XIV-A202. 第1行，第2列
print(xiv_a1plus[1][2])

#既然已經了解到二維列表...那我們可以怎樣做？

#是時候進入...

#XIV-B. 巢狀迴圈

#巢狀迴圈是指迴圈內有迴圈

#XIV-B1. 巢狀迴圈的表示方法
for row in xiv_a1plus: #迴圈1. 把多行列表分成一個個一維列表
    for col in row: #迴圈2. 再把每個一維列表分成一個個值
        print(col)

#XIV-C. 更高維度的列表

#XIV-C1. 三維列表
ddd = [
    [
        ["A","B","C"],
        ["D","E","F"],
        ["G","H","I"]
    ],
    [
        [1,2,3],
        [4,5,6],
        [7,8,9]
    ]
]

#XIV-C2. 三維取值

print(ddd[0][0][0])

#更高維度的自己想吧